VERSION = "1.2.4"

TOKEN = 'token'

URL = "http://www.katt44.ru/index.php?option=com_content&view=article&id=252&Itemid=129"

GROUP_ID = 209119751

STYLES = [0, 1]

BOT_ADD_TEXT = """
Для использования бота необходимо следовать руководству пользователя:
vk.com/@-209119751-rukovodstvo-polzovatelya
"""

HELP_TEXT = """
/sl (command) - начало команды
Команды:
help - вывод всех доступных команд
group (name) - установить группу
table - вывести расписание
advert - вкл/выкл оповещения
info -  информация о боте

Пример команды:
/sl group 20-ТО-1
"""

INFO_TEXT = f"""
Расписание бот (КАТК44) предназначен для оповещения об обновлении или изменении расписания выбранной группы.

Актуальная версия: {VERSION}
Создатель: [id235030523|Сергей Кравченко]"""

UNKNOWN_TEXT = """
Команда не распознана, для помощи наберите
/sl help"""
