VERSION = "1.2.5"

VK_TOKEN = 'token'

URL = "http://katt44.ru/index.php?option=com_content&view=article&id=252&Itemid=129"

# Периодичность проверки изменений на сайте в секундах
CHECK_TIME = 240

BOT_ADD_TEXT = """
Для использования бота необходимо следовать руководству пользователя:
vk.com/@-209119751-rukovodstvo-polzovatelya
"""

HELP_TEXT = """
/sl (command) - начало команды.
Команды:
help - вывод всех доступных команд.
group (name) - установить группу.
table - вывести расписание.
advert - вкл/выкл оповещения.
info - информация о боте.

Пример команды:
/sl group 20-ТО-1
"""

INFO_TEXT = f"""
Расписание КАТК44 | Бот предназначен для оповещения об обновлении или изменении расписания выбранной группы.

Актуальная версия: {VERSION}
Создатель: [id235030523|Сергей Кравченко]"""

UNKNOWN_TEXT = """
Команда не распознана, для помощи наберите
/sl help"""
